
#七声音阶
mode_interval = [['Nature Major','自然大调', ['纯一', '大二', '大三', '纯四', '纯五', '大六', '大七']],         #自然大调
                 ['Nature Minor','自然小调', ['纯一', '大二', '小三', '纯四', '纯五', '小六', '小七']],         #自然小调
                 ['Harmonic Major', '和声大调', ['纯一', '大二', '大三', '纯四', '纯五', '小六', '大七']],       #和声大调
                 ['Harmonic Minor', '和声小调', ['纯一', '大二', '小三', '纯四', '纯五', '大六', '小七']],       #和声小调
                 ['Melody Major','旋律大调', ['纯一', '大二', '大三', '纯四', '纯五', '大六', '大七', '纯一', '小七', '小六', '纯五', '纯四', '大三', '大二', '纯一']],
                 ['Melody Minor','旋律小调', ['纯一', '大二', '小三', '纯四', '纯五', '大六', '大七', '纯一', '小七', '小六', '纯五', '纯四', '小三', '大二', '纯一']],

                 #五声音阶
                 ['Blues Major', '布鲁斯大调',  ['纯一','大二','大三','纯五','大六']],                  #blues大调
                 ['Blues Minor', '布鲁斯小调',  ['纯一','大二','小三','大三','纯五','大六']],           #blues小调

                 ['Chinese Gong', '宫', ['纯一','大二','大三','纯五','大六']],                         #中国 宫  宫 商 角 徵 羽
                 ['Chinese Shang', '商', ['纯一','大二','纯四','纯五','小七']],                        #中国 商  商 角 徵 羽 宫
                 ['Chinese Jiao', '角', ['纯一','小三','纯四','小六','小七']],                         #中国 角  角 徵 羽 宫 商
                 ['Chinese Zheng', '徵', ['纯一','大二','纯四','纯五','大六']],                        #中国 徵  徵 羽 宫 商 角
                 ['Chinese Yu', '羽', ['纯一','小三','纯四','纯五','小七']],                           #中国 羽  羽 宫 商 角 徵

                 ['Phrygian Dominant', '大佛里吉亚', ['纯一', '小二', '大三', '纯四', '纯五', '小六', '小七']],    #大佛里吉亚 1 b2 3 4 5 b6 b7
                 ['Ionian','伊奥尼亚', ['纯一', '大二', '大三', '纯四', '纯五', '大六', '大七']],                  #伊奥尼亚即自然大调
                 ['Dorian', '多利安' , ['纯一', '大二', '小三', '纯四', '纯五', '大六', '小七']],                  #多利安调式 2 3 4 5 6 7 1
                 ['Phrygian','佛里吉亚', ['纯一', '小二', '小三', '纯四', '纯五','小六','小七']],                  #佛里吉亚 3 4 5 6 7 1 2
                 ['Lydian', '莉迪亚', ['纯一', '大二', '大三', '增四减五', '纯五', '大六','大七']],                #莉迪亚 4 5 6 7 1 2 3
                 ['Mixolydian','混合莉迪亚', ['纯一', '大二', '大三', '纯四', '纯五', '大六', '小七']],            #混合莉迪亚 5 6 7 1 2 3 4
                 ['Aonian','艾欧尼亚', ['纯一', '大二', '小三', '纯四', '纯五', '小六', '小七']],                  #艾欧尼亚自然小调 6 7 1 2 3 4 5
                 ['Locrian','洛克尼亚', ['纯一', '小二', '小三', '纯四', '增四减五', '小六', '小七']],             #洛克尼亚 7 1 2 3 4 5 6


                 ['Neopolitan Major','拿波里大音阶', ['纯一', '小二', '小三', '纯四', '纯五', '大六', '大七']],        #拿波里大音阶
                 ['Neopolitan Minor','拿波里小音阶', ['纯一', '小二', '小三', '纯四', '纯五', '小六', '大七']],        #拿波里小音阶
                 ['Super Locrian','超级洛克里亚音阶', ['纯一', '小二', '小三', '大三', '增四减五', '小六', '小七']],   #超级洛克里亚音阶
                 ['Hindu', '印度音阶', ['纯一', '大二', '大三', '纯四', '纯五', '小六', '小七']],                      #印度
                 ['Gypsy', '吉普赛', ['纯一', '小三', '增四减五', '纯五', '小六', '小七']],                            #吉普赛
                 ['Hungarian', '匈牙利音阶', ['纯一', '小三', '大三', '增四减五', '纯五', '大六', '小七']],            #匈牙利音阶
                 ['Hungarian Minor', '匈牙利小调',['纯一', '大二', '小三', '增四减五', '纯五', '小六', '大七']],       #匈牙利小调音阶
                 ['Japan', '日本音阶', ['纯一', '大三', '纯四', '大六', '大七']],                                      #日本音阶
                 #'Russian':['纯一', '小二', '', '', '', '', '', ''],                                                 #俄罗斯音阶
                 ['Jazz Minor', '爵士小调',['纯一', '大二', '小三', '纯四', '纯五', '大六', '大七']],                  #爵士小调
                 ['Arabic','阿拉伯音阶', ['纯一', '小二', '大三', '纯四', '纯五', '小六', '小七']],                    #阿拉伯音阶
                 ['Orient','东方音阶', ['纯一', '小二', '大三', '纯四', '增四减五', '大六', '小七']],                  #东方音阶
                 ['Spanish','西班牙音阶', ['纯一', '小二', '小三', '大三', '纯四', '增四减五', '小六', '小七']],       #西班牙音阶
                 ['C Blues Major','C蓝调大音阶',['纯一', '大二', '小三', '纯四', '增四减五', '小六', '大七']]          #C蓝调大音阶
                 ]

def scales_map(root,mode,mode_name):
    interval =     ['纯一', '小二', '大二', '小三', '大三', '纯四', '增四减五', '纯五', '小六', '大六', '小七', '大七']
    scales_sharp = ['A'   , 'A#'  , 'B'   , 'C'   , 'C#'  , 'D'   ,    'D#'   ,  'E'  ,  'F'  ,  'F#' ,  'G'  ,  'G#']
    scales_flat =  ['A'   , 'Bb'  , 'B'   , 'C'   , 'Db'  , 'D'   ,    'Eb'   ,  'E'  ,  'F'  ,  'Gb' ,  'G'  ,  'Ab']

    if(len(root) >= 2):
        if(root[1] == '#'):
            start = scales_sharp.index(root)
            new_scales = scales_flat[start:12].copy()  # 按首调重新排序
            new_scales += scales_flat[0:start].copy()
        elif(root[1] == 'b'):
            start = scales_flat.index(root)
            new_scales = scales_sharp[start:12].copy()  # 按首调重新排序
            new_scales += scales_sharp[0:start].copy()
        else:
            return 0
    else:
        start = scales_flat.index(root)
        new_scales = scales_sharp[start:12].copy()  # 按首调重新排序
        new_scales += scales_sharp[0:start].copy()

    print('\n'+root + ' ' + mode_name , end=' ')

    scale_dict = {}
    for i in range(0,12):
        scale_dict[interval[i]] = new_scales[i]
    scales = []
    for i in mode:
        scales += [scale_dict[i]]
        print(scale_dict[i], end=' ')
    return scales


if __name__ == '__main__':

    scales = ['A', 'A#', 'B', 'C', 'C#', 'D', 'D#', 'E', 'F', 'F#', 'G', 'G#']
    with open('mode scales.txt','w+') as fp:
        fp.write('音阶表：\n\n')
        for j in mode_interval:
            fp.write(j[1]+'\n')
            for i in scales:
                fp.write(i + '\t' + j[0] + '\t:\t')
                sc = scales_map(i, j[2], j[0])
                for ss in sc:
                    fp.write(ss+'\t')
                fp.write('\n')
            fp.write('\n\n')
